app/controllers/auth_controller.rb

  def register
  user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"