app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)

    if @comment.save
---
INSERT INTO "comments" ("title", "body", "user_id", "festival_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Great Fest!"], ["body", "It was great!"], ["user_id", 1], ["festival_id", 1], ["created_at", 2016-12-11 14:36:29 UTC], ["updated_at", 2016-12-11 14:36:29 UTC]]