app/controllers/festivals_controller.rb

SELECT "festivals".* FROM "festivals" WHERE (festival_name ILIKE '%london%' OR location ILIKE '%london%')
SELECT "festivals".* FROM "festivals"
---
  def index
    # @festivals = Festival.all

    if params[:q]
      @festivals = Festival.where("festival_name ILIKE :q OR location ILIKE :q", q: "%#{params[:q]}%")
    else
      @festivals = Festival.all

SELECT "festivals".* FROM "festivals"
---
  def featured
    @festivals = Festival.all.sample(3)

INSERT INTO "festivals" ("cost", "start", "finish", "minimum_age", "location", "details", "image", "created_at", "updated_at", "latitude", "longitude") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create
    @festival = Festival.new(festival_params)
    @festival.user = current_user

    if @festival.save

UPDATE "festivals" SET "cost" = $1, "updated_at" = $2 WHERE "festivals"."id" = $3  [["cost", 24.0], ["updated_at", 2016-12-12 13:00:50 UTC], ["id", 6]]
---
  def update
    if @festival.update(festival_params)

SELECT  "festivals".* FROM "festivals" WHERE "festivals"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
    def set_festival
      @festival = Festival.find(params[:id])