app/controllers/users_controller.rb

  def update
    # @user.user = current_user

    if @user.update(user_params)
---
UPDATE "users" SET "first_name" = $1, "last_name" = $2, "dob" = $3, "user_location" = $4, "bio" = $5, "updated_at" = $6 WHERE "users"."id" = $7  [["first_name", "test"], ["last_name", "testy"], ["dob", Thu, 01 May 1980], ["user_location", "london"], ["bio", "yo, i am super cool!"], ["updated_at", 2016-12-09 14:25:47 UTC], ["id", 3]]